In [1]:
import numpy as np
import pandas as pd
from pandas import Series, DataFrame

In [5]:
dframe_left = DataFrame({'key':['x','y','z','x','y'],
                   'data':range(5)})

In [6]:
dframe_left

  key  data
0   x     0
1   y     1
2   z     2
3   x     3
4   y     4

In [9]:
dframe_right = DataFrame({'Group_data':[10,10]},index=['x','y'])

In [10]:
dframe_right

   Group_data
x          10
y          10

In [13]:
pd.merge(dframe_left,dframe_right, left_on ='key',right_index= True)
# we are merging two dataframes on left key dataframe key and while right _data frame should not be null

  key  data  Group_data
0   x     0          10
3   x     3          10
1   y     1          10
4   y     4          10

In [14]:
# hierarchy index with data_frame
df_left_hr =DataFrame({'key1':['SF','SF','SF','LA','LA'],
                      'key2': [10,20,30,20,30],
                      'data_set' :np.arange(5.)})

In [15]:
df_left_hr

  key1  key2  data_set
0   SF    10       0.0
1   SF    20       1.0
2   SF    30       2.0
3   LA    20       3.0
4   LA    30       4.0

In [18]:
df_right_hr = DataFrame(np.arange(10).reshape(5,2),
                       index=[['LA','LA','SF','SF','SF'],
                             [20,10,10,10,20]],
                       columns = ['col1','col2'])

In [19]:
df_right_hr

       col1  col2
LA 20     0     1
   10     2     3
SF 10     4     5
   10     6     7
   20     8     9

In [20]:
pd.merge(df_left_hr, df_right_hr, left_on=['key1','key2'], right_index = True)

  key1  key2  data_set  col1  col2
0   SF    10       0.0     4     5
0   SF    10       0.0     6     7
1   SF    20       1.0     8     9
3   LA    20       3.0     0     1

In [23]:
dframe_left.join(dframe_right)

  key  data  Group_data
0   x     0         NaN
1   y     1         NaN
2   z     2         NaN
3   x     3         NaN
4   y     4         NaN